benchmark/FieldExamples/turekFSI3Final/turekFSIBenchmarkOF/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
	//type            symmetryPlane;
    }
    
    bottom
    {
        type            zeroGradient;
	//type            symmetryPlane;
    }
    
    frontback
    {
        type            empty;
    }
    
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    cylinder
    {
        type            zeroGradient;
    }
    
    fsiWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
