benchmark/FieldExamples/turekFSI3Final/turekFSIBenchmarkOF/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
    (0.00 0.00 0.0)	// .0
    (0.44 0.00 0.0)	// .1
    (0.60 0.00 0.0)	// .2
    (2.50 0.00 0.0)	// .3
    (0.16464466 0.16464466 0.0)	// .4
    (0.25 0.19 0.0)	// .5
    (0.60 0.19 0.0)	// .6
    (2.50 0.19 0.0)	// .7
    (0.16464466 0.23535534 0.0)	// .8
    (0.25 0.21 0.0)	// .9
    (0.60 0.21 0.0)	// .10
    (2.50 0.21 0.0)	// .11
    (0.00 0.41 0.0)	// .12
    (0.44 0.41 0.0)	// .13
    (0.60 0.41 0.0)	// .14
    (2.50 0.41 0.0)	// .15
    (0.20 0.15 0.0)	// .16
    (0.15 0.20 0.0)	// .17
    (0.20 0.25 0.0)	// .18
    (0.00 0.00 0.1)	// .19
    (0.44 0.00 0.1)	// .20
    (0.60 0.00 0.1)	// .21
    (2.50 0.00 0.1)	// .22
    (0.16464466 0.16464466 0.1)	// .23
    (0.25 0.19 0.1)	// .24
    (0.60 0.19 0.1)	// .25
    (2.50 0.19 0.1)	// .26
    (0.16464466 0.23535534 0.1)	// .27
    (0.25 0.21 0.1)	// .28
    (0.60 0.21 0.1)	// .29
    (2.50 0.21 0.1)	// .30
    (0.00 0.41 0.1)	// .31
    (0.44 0.41 0.1)	// .32
    (0.60 0.41 0.1)	// .33
    (2.50 0.41 0.1)	// .34
    (0.20 0.15 0.1)	// .35
    (0.15 0.20 0.1)	// .36
    (0.20 0.25 0.1)	// .37
    
);


// The super fine block
// Mesh attributes has been divided by 5 from the original

/*blocks         
(
   hex (8 9 13 12 27 28 32 31) (20 40 1) simpleGrading (1 1 1)
   hex (0 4 8 12 19 23 27 31) (40 20 1) simpleGrading (1 1 1)
   hex (0 1 5 4 19 20 24 23) (20 40 1) simpleGrading (1 1 1)
   hex (9 10 14 13 28 29 33 32) (60 40 1) simpleGrading (1 1 1)
   hex (1 2 6 5 20 21 25 24) (60 40 1) simpleGrading (1 1 1)
   hex (10 11 15 14 29 30 34 33) (75 40 1) simpleGrading (10 1 1)
   hex (2 3 7 6 21 22 26 25) (75 40 1) simpleGrading (10 1 1)
   hex (6 7 11 10 25 26 30 29) (75 5 1) simpleGrading (10 1 1)
);*/
/* blocks         
(
   hex (8 9 13 12 27 28 32 31) (16 32 1) simpleGrading (1 1 1)
   hex (0 4 8 12 19 23 27 31) (32 16 1) simpleGrading (1 1 1)
   hex (0 1 5 4 19 20 24 23) (16 32 1) simpleGrading (1 1 1)
   hex (9 10 14 13 28 29 33 32) (48 32 1) simpleGrading (1 1 1)
   hex (1 2 6 5 20 21 25 24) (48 32 1) simpleGrading (1 1 1)
   hex (10 11 15 14 29 30 34 33) (60 32 1) simpleGrading (10 1 1)
   hex (2 3 7 6 21 22 26 25) (60 32 1) simpleGrading (10 1 1)
   hex (6 7 11 10 25 26 30 29) (60 4 1) simpleGrading (10 1 1)
);*/


blocks          
(
    hex (8 9 13 12 27 28 32 31) (40 80 1) simpleGrading (1 1 1)
    hex (0 4 8 12 19 23 27 31) (80 40 1) simpleGrading (1 1 1)
    hex (0 1 5 4 19 20 24 23) (40 80 1) simpleGrading (1 1 1)
    hex (9 10 14 13 28 29 33 32) (100 80 1) simpleGrading (1 1 1)
    hex (1 2 6 5 20 21 25 24) (100 80 1) simpleGrading (1 1 1)
    hex (10 11 15 14 29 30 34 33) (150 80 1) simpleGrading (10 1 1)
    hex (2 3 7 6 21 22 26 25) (150 80 1) simpleGrading (10 1 1)
    hex (6 7 11 10 25 26 30 29) (150 10 1) simpleGrading (10 1 1)
);


edges           
(
    arc 8 9 (0.20 0.25 0.0)
    arc 4 8 (0.15 0.20 0.0)
    arc 4 5 (0.20 0.15 0.0)
    arc 27 28 (0.20 0.25 0.1)
    arc 23 27 (0.15 0.20 0.1)
    arc 23 24 (0.20 0.15 0.1)
);

boundary
( 
    top
    {
        type wall;
        faces
        (
	    (12 13 32 31)
	    (13 14 33 32)
	    (14 15 34 33)
        );
    }
    
    bottom
    {
	type wall;
	faces
	(
	  (0 1 20 19)
	  (1 2 21 20)
	  (2 3 22 21)
	);
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
	    (8 9 13 12)
	    (0 4 8 12)
	    (0 1 5 4)
	    (9 10 14 13)
	    (1 2 6 5)
	    (10 11 15 14)
	    (2 3 7 6)
	    (6 7 11 10)
	    (27 28 32 31)
	    (19 23 27 31) 
	    (19 20 24 23)
	    (28 29 33 32)
	    (20 21 25 24)
	    (29 30 34 33)
	    (21 22 26 25)
	    (25 26 30 29)
        );
    }
    
    fsiWall 
    {
    	type wall;
    	faces
	(
	    (5 6 25 24)
	    (6 10 29 25)
	    (9 10 29 28)
	);   
    }
    
    inlet 
    {
	 type patch;
	 faces
	 (
	    (0 12 31 19)
	 );  
    }
    
    outlet	
    {
	 type patch;
	 faces
	 (
	   (3 7 26 22)
	   (7 11 30 26)
	   (11 15 34 30)
	 );  
    }
    
    cylinder
    {
	type wall;
	faces
	(
	    (8 9 28 27)
	    (4 8 27 23)
	    (5 4 23 24)
	);
    }
);

mergePatchPairs 
(  
);

// ************************************************************************* //
