benchmark/FieldExamples/turekFSI3Final/turekFSIBenchmarkOF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ( "libgroovyBC.so" );

application     icoFoam;

startFrom       startTime;

startTime       2;

stopAt          endTime;

endTime         12;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           1;

// ************************************************************************* //

functions
{
    forces
    {
        type    forces;
        functionObjectLibs ("libforces.so");
        patches (cylinder fsiWall);
        rhoName rhoInf;
        rhoInf  10000; // THIS IS DUE TO 2D THICKNESS 0.1m
        CofR    (0 0 0);

            outputControl     timeStep;
            outputInterval    1;
    }
}

// ************************************************************************* //
